app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 10 Feb 2015 17:19:33 UTC +00:00], ["name", "Apple"], ["updated_at", Tue, 10 Feb 2015 17:19:33 UTC +00:00]]
---
  def create
    binding.pry
    @category = Category.new(category_params)

    if @category.save