app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params.require(:comment).permit(:body))
    @comment.creator = current_user

    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "first comment in form"], ["created_at", Wed, 11 Feb 2015 22:45:50 UTC +00:00], ["post_id", 1], ["updated_at", Wed, 11 Feb 2015 22:45:50 UTC +00:00]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = 4  [["user_id", 1], ["updated_at", Wed, 11 Feb 2015 22:46:30 UTC +00:00]]

  def vote
    comment = Comment.find(params[:id])
    vote = Vote.create(vote: params[:vote], creator: current_user, voteable: comment)
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 22 Feb 2015 21:43:14 UTC +00:00], ["updated_at", Sun, 22 Feb 2015 21:43:14 UTC +00:00], ["user_id", 1], ["vote", true], ["voteable_id", 2], ["voteable_type", "Comment"]]