app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params.require(:comment).permit(:body))
    @comment.creator = User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1