app/controllers/posts_controller.rb

  def index
    @posts = Post.all.sort_by{|post| post.total_votes}.reverse
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)
    @post.creator = current_user

    if @post.save
---
INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?)

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = 3  [["description", "Pats win! Yeah!"], ["updated_at", Mon, 09 Feb 2015 19:57:46 UTC +00:00]]

  def vote
    vote = Vote.create(vote: params[:vote], creator: current_user, voteable: @post)
---
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 22 Feb 2015 19:46:07 UTC +00:00], ["updated_at", Sun, 22 Feb 2015 19:46:07 UTC +00:00], ["user_id", 4], ["vote", true], ["voteable_id", 2], ["voteable_type", "Post"]]

  def set_post
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 1]]